GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F14Q20.inc
;----- I3C2CON1 Bits -----------------------------------------------------
ACKPOS           EQU  H'0000'
SASDRMD          EQU  H'0001'
FHDRE            EQU  H'0002'
BERRDET          EQU  H'0003'


;----- I3C2RXB Bits -----------------------------------------------------


;----- I3C2TXB Bits -----------------------------------------------------


;----- I3C2STAT0 Bits -----------------------------------------------------
RNW0             EQU  H'0000'
RNW1             EQU  H'0001'
RXBF             EQU  H'0002'
TXBE             EQU  H'0003'
RSTDET           EQU  H'0004'
OPMD0            EQU  H'0005'
OPMD1            EQU  H'0006'
BFREE            EQU  H'0007'


;----- I3C2STAT1 Bits -----------------------------------------------------
TXFNE            EQU  H'0000'


;----- I3C2BSTAT Bits -----------------------------------------------------
TE0ERR           EQU  H'0000'
TE1ERR           EQU  H'0001'
TE2ERR           EQU  H'0002'
TE3ERR           EQU  H'0003'
TE4ERR           EQU  H'0004'
TE5ERR           EQU  H'0005'
TE6ERR           EQU  H'0006'


;----- I3C2PIR0 Bits -----------------------------------------------------
SCCCIF           EQU  H'0000'
BTFIF            EQU  H'0001'
DADRIF           EQU  H'0002'
SADRIF           EQU  H'0003'
I2CACKIF         EQU  H'0004'
RSCIF            EQU  H'0005'
PCIF             EQU  H'0006'
SCIF             EQU  H'0007'


;----- I3C2PIR1 Bits -----------------------------------------------------
IBIDONEIF        EQU  H'0005'
DACHIF           EQU  H'0006'
TCOMPIF          EQU  H'0007'


;----- I3C2ERRIR0 Bits -----------------------------------------------------
UCCCIF           EQU  H'0000'
BTOIF            EQU  H'0001'
BUSEIF           EQU  H'0002'
IBIEIF           EQU  H'0003'
HJEIF            EQU  H'0004'
RXOIF            EQU  H'0005'
TXUIF            EQU  H'0006'
I2CNACKIF        EQU  H'0007'


;----- I3C2ERRIR1 Bits -----------------------------------------------------
RXREIF           EQU  H'0000'
TXWEIF           EQU  H'0001'
MWLOEIF          EQU  H'0002'
ABEIF            EQU  H'0003'


;----- I3C2PIE0 Bits -----------------------------------------------------
SCCCIE           EQU  H'0000'
BTFIE            EQU  H'0001'
DADRIE           EQU  H'0002'
SADRIE           EQU  H'0003'
I2CACKIE         EQU  H'0004'
RSCIE            EQU  H'0005'
PCIE             EQU  H'0006'
SCIE             EQU  H'0007'


;----- I3C2PIE1 Bits -----------------------------------------------------
IBIDONEIE        EQU  H'0005'
DACHIE           EQU  H'0006'
TCOMPIE          EQU  H'0007'


;----- I3C2ERRIE0 Bits -----------------------------------------------------
UCCCIE           EQU  H'0000'
BTOIE            EQU  H'0001'
BUSEIE           EQU  H'0002'
IBIEIE           EQU  H'0003'
HJEIE            EQU  H'0004'
RXOIE            EQU  H'0005'
TXUIE            EQU  H'0006'
I2CNACKIE        EQU  H'0007'


;----- I3C2ERRIE1 Bits -----------------------------------------------------
RXREIE           EQU  H'0000'
TXWEIE           EQU  H'0001'
MWLOEIE          EQU  H'0002'
ABEIE            EQU  H'0003'


;----- I3C2BIDL Bits -----------------------------------------------------


;----- I3C2BIDLH Bits -----------------------------------------------------


;----- I3C2BAVL Bits -----------------------------------------------------


;----- I3C2BTO Bits -----------------------------------------------------


;----- I3C2BTOH Bits -----------------------------------------------------


;----- I3C2IBIMDB Bits -----------------------------------------------------
IBIMDB_4_00      EQU  H'0000'
IBIMDB_4_01      EQU  H'0001'
IBIMDB_4_02      EQU  H'0002'
IBIMDB_4_03      EQU  H'0003'
IBIMDB_4_04      EQU  H'0004'
IBIMDB_7_50      EQU  H'0005'
IBIMDB_7_51      EQU  H'0006'
IBIMDB_7_52      EQU  H'0007'


;----- I3C2RETRY Bits -----------------------------------------------------


;----- I3C2FEAT Bits -----------------------------------------------------
HJCAP            EQU  H'0000'
HDRCAP           EQU  H'0001'


;----- I3C2SADR Bits -----------------------------------------------------
SADR0            EQU  H'0000'
SADR1            EQU  H'0001'
SADR2            EQU  H'0002'
SADR3            EQU  H'0003'
SADR4            EQU  H'0004'
SADR5            EQU  H'0005'
SADR6            EQU  H'0006'


;----- I3C2DADR Bits -----------------------------------------------------
DADR0            EQU  H'0000'
DADR1            EQU  H'0001'
DADR2            EQU  H'0002'
DADR3            EQU  H'0003'
DADR4            EQU  H'0004'
DADR5            EQU  H'0005'
DADR6            EQU  H'0006'


;----- I3C2EC Bits -----------------------------------------------------
IBIEN            EQU  H'0000'
CREN             EQU  H'0001'
EC2              EQU  H'0002'
HJEN             EQU  H'0003'
EC_7_40          EQU  H'0004'
EC_7_41          EQU  H'0005'
EC_7_42          EQU  H'0006'
EC_7_43          EQU  H'0007'


;----- I3C2MWL Bits -----------------------------------------------------


;----- I3C2MWLH Bits -----------------------------------------------------


;----- I3C2MRL Bits -----------------------------------------------------


;----- I3C2MRLH Bits -----------------------------------------------------


;----- I3C2IBIPSZ Bits -----------------------------------------------------


;----- I3C2PID0 Bits -----------------------------------------------------
PID0             EQU  H'0000'
PID1             EQU  H'0001'
PID2             EQU  H'0002'
PID3             EQU  H'0003'
PID4             EQU  H'0004'
PID5             EQU  H'0005'
PID6             EQU  H'0006'
PID7             EQU  H'0007'


;----- I3C2PID1 Bits -----------------------------------------------------
PID8             EQU  H'0000'
PID9             EQU  H'0001'
PID10            EQU  H'0002'
PID11            EQU  H'0003'
PID12            EQU  H'0004'
PID13            EQU  H'0005'
PID14            EQU  H'0006'
PID15            EQU  H'0007'
PID_11_80        EQU  H'0000'
PID_11_81        EQU  H'0001'
PID_11_82        EQU  H'0002'
PID_11_83        EQU  H'0003'
PID_15_120       EQU  H'0004'
PID_15_121       EQU  H'0005'
PID_15_122       EQU  H'0006'
PID_15_123       EQU  H'0007'


;----- I3C2PID2 Bits -----------------------------------------------------
PID16            EQU  H'0000'
PID17            EQU  H'0001'
PID18            EQU  H'0002'
PID19            EQU  H'0003'
PID20            EQU  H'0004'
PID21            EQU  H'0005'
PID22            EQU  H'0006'
PID23            EQU  H'0007'


;----- I3C2PID3 Bits -----------------------------------------------------
PID24            EQU  H'0000'
PID25            EQU  H'0001'
PID26            EQU  H'0002'
PID27            EQU  H'0003'
PID28            EQU  H'0004'
PID29            EQU  H'0005'
PID30            EQU  H'0006'
PID31            EQU  H'0007'


