GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F14Q20.inc
;----- I3C2PID4 Bits -----------------------------------------------------
PID32            EQU  H'0000'
PID33            EQU  H'0001'
PID34            EQU  H'0002'
PID35            EQU  H'0003'
PID36            EQU  H'0004'
PID37            EQU  H'0005'
PID38            EQU  H'0006'
PID39            EQU  H'0007'
PID_39_330       EQU  H'0001'
PID_39_331       EQU  H'0002'
PID_39_332       EQU  H'0003'
PID_39_333       EQU  H'0004'
PID_39_334       EQU  H'0005'
PID_39_335       EQU  H'0006'
PID_39_336       EQU  H'0007'


;----- I3C2PID5 Bits -----------------------------------------------------
PID40            EQU  H'0000'
PID41            EQU  H'0001'
PID42            EQU  H'0002'
PID43            EQU  H'0003'
PID44            EQU  H'0004'
PID45            EQU  H'0005'
PID46            EQU  H'0006'
PID47            EQU  H'0007'


;----- I3C2BCR Bits -----------------------------------------------------
BCR0             EQU  H'0000'
BCR1             EQU  H'0001'
BCR2             EQU  H'0002'
BCR3             EQU  H'0003'
BCR4             EQU  H'0004'
BCR5             EQU  H'0005'
BCR6             EQU  H'0006'
BCR7             EQU  H'0007'
BCR_7_60         EQU  H'0006'
BCR_7_61         EQU  H'0007'


;----- I3C2DCR Bits -----------------------------------------------------


;----- I3C2DSTAT0 Bits -----------------------------------------------------
INTPEND0         EQU  H'0000'
INTPEND1         EQU  H'0001'
INTPEND2         EQU  H'0002'
INTPEND3         EQU  H'0003'
PERR             EQU  H'0005'
ACTMODE0         EQU  H'0006'
ACTMODE1         EQU  H'0007'
INPEND0          EQU  H'0000'
INTPEND1         EQU  H'0001'
INTPEND2         EQU  H'0002'
INTPEND3         EQU  H'0003'
ACTMODE0         EQU  H'0006'
ACTMODE1         EQU  H'0007'


;----- I3C2DSTAT1 Bits -----------------------------------------------------
VRSV0            EQU  H'0000'
VRSV1            EQU  H'0001'
VRSV2            EQU  H'0002'
VRSV3            EQU  H'0003'
VRSV4            EQU  H'0004'
VRSV5            EQU  H'0005'
VRSV6            EQU  H'0006'
VRSV7            EQU  H'0007'


;----- I3C2MWS Bits -----------------------------------------------------
MWS0             EQU  H'0000'
MWS1             EQU  H'0001'
MWS2             EQU  H'0002'
MWS3             EQU  H'0003'
MWS4             EQU  H'0004'
MWS5             EQU  H'0005'
MWS6             EQU  H'0006'
MWS7             EQU  H'0007'
MWS_2_00         EQU  H'0000'
MWS_2_01         EQU  H'0001'
MWS_2_02         EQU  H'0002'
MWS_7_40         EQU  H'0004'
MWS_7_41         EQU  H'0005'
MWS_7_42         EQU  H'0006'
MWS_7_43         EQU  H'0007'


;----- I3C2MRS Bits -----------------------------------------------------
MRS0             EQU  H'0000'
MRS1             EQU  H'0001'
MRS2             EQU  H'0002'
MRS3             EQU  H'0003'
MRS4             EQU  H'0004'
MRS5             EQU  H'0005'
MRS6             EQU  H'0006'
MRS7             EQU  H'0007'
MRS_2_00         EQU  H'0000'
MRS_2_01         EQU  H'0001'
MRS_2_02         EQU  H'0002'
MRS_5_30         EQU  H'0003'
MRS_5_31         EQU  H'0004'
MRS_5_32         EQU  H'0005'


;----- I3C2MRT Bits -----------------------------------------------------


;----- I3C2MRTH Bits -----------------------------------------------------


;----- I3C2MRTU Bits -----------------------------------------------------


;----- I3C2RSTACT Bits -----------------------------------------------------


;----- I3C2BUSCXT Bits -----------------------------------------------------


;----- I3C2CCC Bits -----------------------------------------------------


;----- I3C2I2CCON Bits -----------------------------------------------------
SDAHT0           EQU  H'0000'
SDAHT1           EQU  H'0001'
FLTEN            EQU  H'0002'


;----- I3C2CLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'


;----- CLKRCON Bits -----------------------------------------------------
DIV0             EQU  H'0000'
DIV1             EQU  H'0001'
DIV2             EQU  H'0002'
DC0              EQU  H'0003'
DC1              EQU  H'0004'
EN               EQU  H'0007'
CLKRDIV0         EQU  H'0000'
CLKRDIV1         EQU  H'0001'
CLKRDIV2         EQU  H'0002'
CLKRDC0          EQU  H'0003'
CLKRDC1          EQU  H'0004'
CLKREN           EQU  H'0007'
DIV0             EQU  H'0000'
DIV1             EQU  H'0001'
DIV2             EQU  H'0002'
DC0              EQU  H'0003'
DC1              EQU  H'0004'


;----- CLKRCLK Bits -----------------------------------------------------
CLKRCLK0         EQU  H'0000'
CLKRCLK1         EQU  H'0001'
CLKRCLK2         EQU  H'0002'
CLKRCLK3         EQU  H'0003'
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'


;----- TMR0L Bits -----------------------------------------------------
TMR0L0           EQU  H'0000'
TMR0L1           EQU  H'0001'
TMR0L2           EQU  H'0002'
TMR0L3           EQU  H'0003'
TMR0L4           EQU  H'0004'
TMR0L5           EQU  H'0005'
TMR0L6           EQU  H'0006'
TMR0L7           EQU  H'0007'


;----- TMR0H Bits -----------------------------------------------------
TMR0H0           EQU  H'0000'
TMR0H1           EQU  H'0001'
TMR0H2           EQU  H'0002'
TMR0H3           EQU  H'0003'
TMR0H4           EQU  H'0004'
TMR0H5           EQU  H'0005'
TMR0H6           EQU  H'0006'
TMR0H7           EQU  H'0007'
T0PR0            EQU  H'0000'
T0PR1            EQU  H'0001'
T0PR2            EQU  H'0002'
T0PR3            EQU  H'0003'
T0PR4            EQU  H'0004'
T0PR5            EQU  H'0005'
T0PR6            EQU  H'0006'
T0PR7            EQU  H'0007'


;----- T0CON0 Bits -----------------------------------------------------
OUTPS0           EQU  H'0000'
OUTPS1           EQU  H'0001'
OUTPS2           EQU  H'0002'
OUTPS3           EQU  H'0003'
MD16             EQU  H'0004'
OUT_T0CON0       EQU  H'0005'
EN               EQU  H'0007'
T0OUTPS0         EQU  H'0000'
T0OUTPS1         EQU  H'0001'
T0OUTPS2         EQU  H'0002'
T0OUTPS3         EQU  H'0003'
T0MD16           EQU  H'0004'
T0OUT            EQU  H'0005'
T0EN             EQU  H'0007'
OUTPS0           EQU  H'0000'
OUTPS1           EQU  H'0001'
OUTPS2           EQU  H'0002'
OUTPS3           EQU  H'0003'
T016BIT          EQU  H'0004'
T0OUTPS0         EQU  H'0000'
T0OUTPS1         EQU  H'0001'
T0OUTPS2         EQU  H'0002'
T0OUTPS3         EQU  H'0003'


;----- T0CON1 Bits -----------------------------------------------------
CKPS0_T0CON1     EQU  H'0000'
CKPS1_T0CON1     EQU  H'0001'
CKPS2_T0CON1     EQU  H'0002'
CKPS3            EQU  H'0003'
ASYNC            EQU  H'0004'
CS0_T0CON1       EQU  H'0005'
CS1_T0CON1       EQU  H'0006'
CS2_T0CON1       EQU  H'0007'
CKPS0_T0CON1     EQU  H'0000'
CKPS1_T0CON1     EQU  H'0001'
CKPS2_T0CON1     EQU  H'0002'
CKPS3            EQU  H'0003'
T0ASYNC          EQU  H'0004'
CS0_T0CON1       EQU  H'0005'
CS1_T0CON1       EQU  H'0006'
CS2_T0CON1       EQU  H'0007'
T0CKPS0          EQU  H'0000'
T0CKPS1          EQU  H'0001'
T0CKPS2          EQU  H'0002'
T0CKPS3          EQU  H'0003'
T0CS0            EQU  H'0005'
T0CS1            EQU  H'0006'
T0CS2            EQU  H'0007'
T0CKPS0          EQU  H'0000'
T0CKPS1          EQU  H'0001'
T0CKPS2          EQU  H'0002'
T0CKPS3          EQU  H'0003'
T0CS0            EQU  H'0005'
T0CS1            EQU  H'0006'
T0CS2            EQU  H'0007'


;----- TMR1 Bits -----------------------------------------------------
TMR1L0           EQU  H'0000'
TMR1L1           EQU  H'0001'
TMR1L2           EQU  H'0002'
TMR1L3           EQU  H'0003'
TMR1L4           EQU  H'0004'
TMR1L5           EQU  H'0005'
TMR1L6           EQU  H'0006'
TMR1L7           EQU  H'0007'
TMR10            EQU  H'0000'
TMR11            EQU  H'0001'
TMR12            EQU  H'0002'
TMR13            EQU  H'0003'
TMR14            EQU  H'0004'
TMR15            EQU  H'0005'
TMR16            EQU  H'0006'
TMR17            EQU  H'0007'


;----- TMR1H Bits -----------------------------------------------------
TMR1H0           EQU  H'0000'
TMR1H1           EQU  H'0001'
TMR1H2           EQU  H'0002'
TMR1H3           EQU  H'0003'
TMR1H4           EQU  H'0004'
TMR1H5           EQU  H'0005'
TMR1H6           EQU  H'0006'
TMR1H7           EQU  H'0007'
TMR18            EQU  H'0000'
TMR19            EQU  H'0001'
TMR110           EQU  H'0002'
TMR111           EQU  H'0003'
TMR112           EQU  H'0004'
TMR113           EQU  H'0005'
TMR114           EQU  H'0006'
TMR115           EQU  H'0007'


;----- T1CON Bits -----------------------------------------------------
ON_T1CON         EQU  H'0000'
RD16             EQU  H'0001'
NOT_SYNC         EQU  H'0002'
CKPS0_T1CON      EQU  H'0004'
CKPS1_T1CON      EQU  H'0005'
TMR1ON           EQU  H'0000'
T1RD16           EQU  H'0001'
NOT_T1SYNC       EQU  H'0002'
T1CKPS0          EQU  H'0004'
T1CKPS1          EQU  H'0005'
NSYNC            EQU  H'0002'
CKPS0_T1CON      EQU  H'0004'
CKPS1_T1CON      EQU  H'0005'
RD161            EQU  H'0001'
NT1SYNC          EQU  H'0002'


