GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F14Q20.inc
;----- CONFIG4 Options --------------------------------------------------
_BORV_VBOR_1P9_4     EQU  H'FF'; Brown-out Reset Voltage (VBOR) set to 1.9V
_BORV_VBOR_2P45_4    EQU  H'FE'; Brown-out Reset Voltage (VBOR) set to 2.45V
_BORV_VBOR_2P7_4     EQU  H'FD'; Brown-out Reset Voltage (VBOR) set to 2.7V
_BORV_VBOR_2P85_4    EQU  H'FC'; Brown-out Reset Voltage (VBOR) set to 2.8V
_PPS1WAY_ON_4        EQU  H'FF'; PPSLOCKED bit can be cleared and set only once; PPS registers remain locked after one clear/set cycle
_PPS1WAY_OFF_4       EQU  H'F7'; PPSLOCKED bit can be set and cleared repeatedly (subject to the unlock sequence)
_STVREN_ON_4         EQU  H'FF'; Stack full/underflow will cause Reset
_STVREN_OFF_4        EQU  H'EF'; Stack full/underflow will not cause Reset
_LVP_ON_4            EQU  H'FF'; Low voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored
_LVP_OFF_4           EQU  H'DF'; HV on MCLR/VPP must be used for programming
_DEBUG_OFF_4         EQU  H'FF'; Backround debugger disabled
_DEBUG_ON_4          EQU  H'BF'; Background debugger enabled
_XINST_OFF_4         EQU  H'FF'; Extended Instruction Set and Indexed Addressing Mode disabled
_XINST_ON_4          EQU  H'7F'; Extended Instruction Set and Indexed Addressing Mode enabled

;----- CONFIG5 Options --------------------------------------------------
_WDTCPS_WDTCPS_0_5   EQU  H'E0'; Divider ratio 1:32
_WDTCPS_WDTCPS_1_5   EQU  H'E1'; Divider ratio 1:64
_WDTCPS_WDTCPS_2_5   EQU  H'E2'; Divider ratio 1:128
_WDTCPS_WDTCPS_3_5   EQU  H'E3'; Divider ratio 1:256
_WDTCPS_WDTCPS_4_5   EQU  H'E4'; Divider ratio 1:512
_WDTCPS_WDTCPS_5_5   EQU  H'E5'; Divider ratio 1:1024
_WDTCPS_WDTCPS_6_5   EQU  H'E6'; Divider ratio 1:2048
_WDTCPS_WDTCPS_7_5   EQU  H'E7'; Divider ratio 1:4096
_WDTCPS_WDTCPS_8_5   EQU  H'E8'; Divider ratio 1:8192
_WDTCPS_WDTCPS_9_5   EQU  H'E9'; Divider ratio 1:16384
_WDTCPS_WDTCPS_10_5  EQU  H'EA'; Divider ratio 1:32768
_WDTCPS_WDTCPS_11_5  EQU  H'EB'; Divider ratio 1:65536
_WDTCPS_WDTCPS_12_5  EQU  H'EC'; Divider ratio 1:131072
_WDTCPS_WDTCPS_13_5  EQU  H'ED'; Divider ratio 1:262144
_WDTCPS_WDTCPS_14_5  EQU  H'EE'; Divider ratio 1:524299
_WDTCPS_WDTCPS_15_5  EQU  H'EF'; Divider ratio 1:1048576
_WDTCPS_WDTCPS_16_5  EQU  H'F0'; Divider ratio 1:2097152
_WDTCPS_WDTCPS_17_5  EQU  H'F1'; Divider ratio 1:4194304
_WDTCPS_WDTCPS_18_5  EQU  H'F2'; Divider ratio 1:8388608
_WDTCPS_WDTCPS_19_5  EQU  H'F3'; Divider ratio 1:32
_WDTCPS_WDTCPS_20_5  EQU  H'F4'; Divider ratio 1:32
_WDTCPS_WDTCPS_21_5  EQU  H'F5'; Divider ratio 1:32
_WDTCPS_WDTCPS_22_5  EQU  H'F6'; Divider ratio 1:32
_WDTCPS_WDTCPS_23_5  EQU  H'F7'; Divider ratio 1:32
_WDTCPS_WDTCPS_24_5  EQU  H'F8'; Divider ratio 1:32
_WDTCPS_WDTCPS_25_5  EQU  H'F9'; Divider ratio 1:32
_WDTCPS_WDTCPS_26_5  EQU  H'FA'; Divider ratio 1:32
_WDTCPS_WDTCPS_27_5  EQU  H'FB'; Divider ratio 1:32
_WDTCPS_WDTCPS_28_5  EQU  H'FC'; Divider ratio 1:32
_WDTCPS_WDTCPS_29_5  EQU  H'FD'; Divider ratio 1:32
_WDTCPS_WDTCPS_30_5  EQU  H'FE'; Divider ratio 1:32
_WDTCPS_WDTCPS_31_5  EQU  H'FF'; Divider ratio 1:65536; software control of WDTPS
_WDTE_OFF_5          EQU  H'9F'; WDT Disabled; SEN is ignored
_WDTE_SEN_5          EQU  H'BF'; WDT enabled/disabled by SEN bit
_WDTE_NSLEEP_5       EQU  H'DF'; WDT enabled while sleep=0, suspended when sleep=1; SEN ignored
_WDTE_ON_5           EQU  H'FF'; WDT enabled regardless of sleep; SEN is ignored

;----- CONFIG6 Options --------------------------------------------------
_WDTCWS_WDTCWS_0_6   EQU  H'F8'; window delay = 87.5; no software control; keyed access required
_WDTCWS_WDTCWS_1_6   EQU  H'F9'; window delay = 75 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_2_6   EQU  H'FA'; window delay = 62.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_3_6   EQU  H'FB'; window delay = 50 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_4_6   EQU  H'FC'; window delay = 37.5 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_5_6   EQU  H'FD'; window delay = 25 percent of time; no software control; keyed access required
_WDTCWS_WDTCWS_6_6   EQU  H'FE'; window always open (100%); no software control; keyed access required
_WDTCWS_WDTCWS_7_6   EQU  H'FF'; window always open (100%); software control; keyed access not required
_WDTCCS_LFINTOSC_6   EQU  H'C7'; WDT reference clock is the 31.0 kHz LFINTOSC (when WDTE != 0b00)
_WDTCCS_MFINTOSC_6   EQU  H'CF'; WDT reference clock is the 31.25kHz MFINTOSC output (when WDTE != 0b00)
_WDTCCS_SOSC_6       EQU  H'D7'; WDT reference clock is SOSC (when WDTE != 0b00)
_WDTCCS_SC_6         EQU  H'FF'; Software Control (when WDTE != 0b00)

;----- CONFIG7 Options --------------------------------------------------
_VDDIO2MD_STANDARD_RANGE_7 EQU  H'FF'; Standard Operating Range (VDDIO2 >= 1.62V)
_VDDIO2MD_LOW_VOLTAGE_RANGE_7 EQU  H'FE'; Low-voltage Operating Range (VDDIO2 < 1.62V)
_VDDIO3MD_STANDARD_RANGE_7 EQU  H'FF'; Standard Operating Range (VDDIO3 >= 1.62V)
_VDDIO3MD_LOW_VOLTAGE_RANGE_7 EQU  H'FD'; Low-voltage Operating Range (VDDIO3 < 1.62V)

;----- CONFIG8 Options --------------------------------------------------
_BBSIZE_BBSIZE_4096_8 EQU  H'1F'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_3968_8 EQU  H'1E'; Boot Block size is 3968 words
_BBSIZE_BBSIZE_3840_8 EQU  H'1D'; Boot Block size is 3840 words
_BBSIZE_BBSIZE_3712_8 EQU  H'1C'; Boot Block size is 3712 words
_BBSIZE_BBSIZE_3584_8 EQU  H'1B'; Boot Block size is 3584 words
_BBSIZE_BBSIZE_3456_8 EQU  H'1A'; Boot Block size is 3456 words
_BBSIZE_BBSIZE_3328_8 EQU  H'19'; Boot Block size is 3328 words
_BBSIZE_BBSIZE_3200_8 EQU  H'18'; Boot Block size is 3200 words
_BBSIZE_BBSIZE_3072_8 EQU  H'17'; Boot Block size is 3072 words
_BBSIZE_BBSIZE_2944_8 EQU  H'16'; Boot Block size is 2944 words
_BBSIZE_BBSIZE_2816_8 EQU  H'15'; Boot Block size is 2816 words
_BBSIZE_BBSIZE_2688_8 EQU  H'14'; Boot Block size is 2688 words
_BBSIZE_BBSIZE_2560_8 EQU  H'13'; Boot Block size is 2560 words
_BBSIZE_BBSIZE_2432_8 EQU  H'12'; Boot Block size is 2432 words
_BBSIZE_BBSIZE_2304_8 EQU  H'11'; Boot Block size is 2304 words
_BBSIZE_BBSIZE_2176_8 EQU  H'10'; Boot Block size is 2176 words
_BBSIZE_BBSIZE_2048_8 EQU  H'F0'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1920_8 EQU  H'E0'; Boot Block size is 1920 words
_BBSIZE_BBSIZE_1792_8 EQU  H'D0'; Boot Block size is 1792 words
_BBSIZE_BBSIZE_1664_8 EQU  H'C0'; Boot Block size is 1664 words
_BBSIZE_BBSIZE_1536_8 EQU  H'B0'; Boot Block size is 1536 words
_BBSIZE_BBSIZE_1408_8 EQU  H'A0'; Boot Block size is 1408 words
_BBSIZE_BBSIZE_1280_8 EQU  H'90'; Boot Block size is 1280 words
_BBSIZE_BBSIZE_1152_8 EQU  H'80'; Boot Block size is 1152 words
_BBSIZE_BBSIZE_1024_8 EQU  H'70'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_896_8 EQU  H'60'; Boot Block size is 896 words
_BBSIZE_BBSIZE_768_8 EQU  H'50'; Boot Block size is 768 words
_BBSIZE_BBSIZE_640_8 EQU  H'40'; Boot Block size is 640 words
_BBSIZE_BBSIZE_512_8 EQU  H'30'; Boot Block size is 512 words
_BBSIZE_BBSIZE_384_8 EQU  H'20'; Boot Block size is 384 words
_BBSIZE_BBSIZE_256_8 EQU  H'10'; Boot Block size is 256 words
_BBSIZE_BBSIZE_128_8 EQU  H'00'; Boot Block size is 128 words

